# Introduction

In this project we will be working with data from the CIA World Factbook.

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db
## connect Jupyter Notebook to the database file via line magic funtions

'Connected: None@factbook.db'

In [2]:
%%sql
-- to run SQL queries in Jupyter, we have to add this line
SELECT * FROM facts LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

## Summary Statistics

Start exploring dataset by looking at summary statistics and finding outliers.

In [3]:
%%sql
SELECT
    MIN(population) min_pop, 
    MAX(population) max_pop, 
    MIN(population_growth) min_pop_growth, 
    MAX(population_growth) max_pop_growth
FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

## Exploring Outliers

We see that there is a country with popluation of 0 and country with population of over 7.2 billion, these should be investigated further.

In [4]:
%%sql
SELECT name min_pop_country
FROM facts
WHERE population = (SELECT MIN(population) FROM facts);

Done.

[('Antarctica',)]

In [5]:
%%sql
SELECT name max_pop_country
FROM facts
WHERE population = (SELECT MAX(population) FROM facts);

Done.

[('World',)]

## Exploring Average Population and Area

In [6]:
%%sql
SELECT 
    ROUND(AVG(population), 3) avg_pop,
    ROUND(AVG(area), 3) avg_area
FROM facts;

Done.

[(62094928.322, 555093.546)]

## Finding Densely Populated Countries

Here is a list of densely populated countries.
We filtered based on two criteria: population above average and area below average.

In [7]:
%%sql
SELECT name country
FROM facts
WHERE population > (SELECT AVG(population) FROM facts)
AND area < (SELECT AVG(area) FROM facts);

Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]